function script_spacecraft()
clc; clear all;

q_tek
delta_q -> V -> P -> 
q_kon


% Начальные условия полжения и ориентации КА
rx      = 0;
ry      = 0;
rz      = 0;
Vx      = 10;
Vy      = 0;
Vz      = 0;

psi     = deg2rad(0);
theta   = deg2rad(0);
gamma   = deg2rad(0);
omega_x = deg2rad(0);
omega_y = deg2rad(0);
omega_z = deg2rad(0);

% Перевод в бикватернионную форму
dual_omega = [0 omega_x omega_y omega_z  0 Vx Vy Vz];                  % Начальная угловая и линейная скорости
dual_q     = dq_from_euler_translation([psi theta gamma], [rx ry rz]); % Начальная ориентация и положение ЛА

% Интегрирование системы
options = odeset('RelTol', 2e-2);
[t, x] = ode45(@dx_dt, [0:0.5:50], [dual_omega, dual_q], options);

d_omega = x(:, 1:8);
d_q     = x(:, 9:16)

end

function dx_dt = dx_dt(t, x)
dual_omega = x(1:8)';  % Бикватернион угловой и линейной скоростей
dual_q     = x(9:16)'; % Бикватернион положения ЛА вокруг центра масс и центра масс

omega = dual_omega(2:4); % Угловая скорость, [рад/с]
V     = dual_omega(6:8); % Линейная скорость, [м/с]

[psi theta gamma] = dq_get_rotation_euler(dual_q);     % Углы ориентации, [рад]
r                 = dq_get_translation_vector(dual_q); % Радиус-вектор положения ЛА, [м]

% -------------------------------------------------------------------------
% Константы и характеристики КА
% -------------------------------------------------------------------------
MU_EARTH = 398600.4415; % Геоцентрическая гравитационная постоянная, [км^3*c^(?2)]
mass     = 100;         % Масса КА, [кг]

% -------------------------------------------------------------------------
% Тензор инерции
% -------------------------------------------------------------------------
Jq = [1  0       0        0;
      0  3.670   0        0;
      0  0       3.710    0;
      0  0       0        0.104];
mq = [1   0    0    0;
      0  mass  0    0;
      0   0   mass  0;
      0   0    0   mass]; 
  
dual_J = [  Jq       zeros(4); 
          zeros(4)     mq];

% -------------------------------------------------------------------------
% Гравитационная сила
% -------------------------------------------------------------------------

Fg_nsk = -MU_EARTH*[r(1) r(2) r(3)]/norm(r)^3;
% Fg     = Fg_nsk*nsk2ssk(gamma, psi, theta);

% -------------------------------------------------------------------------
% Сумма сил
% -------------------------------------------------------------------------
dual_F = [0 Fg_nsk 0 0 0 0];

% -------------------------------------------------------------------------
% Уравнения движения
% -------------------------------------------------------------------------
d_dual_omega_dt = dual_J\dual_F' - dual_J\dq_cross([dual_omega(1:4) 0 0 0 0], (dual_J*dual_omega')')'; 
d_dual_q_dt     = 0.5*dq_multiply(dual_q, dual_omega);

dx_dt = [d_dual_omega_dt; d_dual_q_dt'];


end